Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: One may also use pod directives to quickly comment out a section of code.
es_es: Uno puede también usar directivas pod para comentar, de forma rápida, una sección de código.

source: =head2 Plain Old Comments (Not!) X<comment> X<line> X<#> X<preprocessor> X<eval>
es_es: =head2 Comentarios a la vieja usanza X<comentario> X<línea> X<#> X<preprocesador> X<eval>

source: Perl can process line directives, much like the C preprocessor.
es_es: Perl puede procesar directivas como lo hace el preprocesador de C.

source: Using this, one can control Perl's idea of filenames and line numbers in error or warning messages (especially for strings that are processed with C<eval()>).
es_es: Usando esto, uno puede controlar la idea que tiene Perl de los nombres de archivos y número de líneas un los mensajes de avisos y errores (especialmente para los strings procesados con C<eval()>).

source: The syntax for this mechanism is the same as for most C preprocessors: it matches the regular expression
es_es: La sintaxis de este mecanismo es el mismo que para la mayoría de preprocesadores de C: coincide con la expresión regular

source: # example: '# line 42 "new_filename.plx"'
es_es: # ejemplo: '# line 42 "nuevo_fichero.plx"'

source: with C<$1> being the line number for the next line, and C<$3> being the optional filename (specified with or without quotes).
es_es: con C<$1> siendo el número de línea para la línea siguiente y C<$3> siendo el nombre de fichero opcional (especificado con o sin comillas).

source: There is a fairly obvious gotcha included with the line directive: Debuggers and profilers will only show the last source line to appear at a particular line number in a given file.
es_es: Existe obviamente un problema con esta directiva: los I<debuggers> y perfiladores sólo mostrarán la última línea del código fuente que aparece en un número de línea en particular de un determinado fichero.

source: Care should be taken not to cause line number collisions in code you'd like to debug later.
es_es: Hay que tener cuidado para no causar colisiones de números de línea en el código que pretendas debuggear más tarde.

source: Here are some examples that you should be able to type into your command shell:
es_es: Aquí hay algunos ejemplos que será capaz de escribir en la línea de comandos del shell:

source: # the `#' on the previous line must be the first char on line
es_es: # el `#' en la línea anterior debe ser el primer carácter de la línea

source: perlstyle - Perl style guide
es_es: perlstyle - Guía de estilo Perl

source: Each programmer will, of course, have his or her own preferences in regards to formatting, but there are some general guidelines that will make your programs easier to read, understand, and maintain.
es_es: Cada programador tendrá, naturalmente, sus propias preferencias con respecto al estilo, pero hay algunas directrices que harán sus programas más fáciles de leer, entender y mantener.

source: The most important thing is to run your programs under the B<-w> flag at all times.
es_es: Lo más importante es ejecutar siempre sus programas con la opción B<-w> puesta.

source: You may turn it off explicitly for particular portions of code via the C<no warnings> pragma or the C<$^W> variable if you must.
es_es: Puede desactivarla explícitamente en partes del código con el pragma C<no warnings> o con la variable C<$^W> si así lo desea.

source: You should also always run under C<use strict> or know the reason why not.
es_es: Debería siempre también correr con C<use strict> o conocer la razón de porqué no hacerlo.

source: The C<use sigtrap> and even C<use diagnostics> pragmas may also prove useful.
es_es: El pragma C<use sigtrap> e incluso el C<use diagnostics> pueden ser también muy útiles.

source: Regarding aesthetics of code lay out, about the only thing Larry cares strongly about is that the closing curly bracket of a multi-line BLOCK should line up with the keyword that started the construct.
es_es: Con respecto a la estética del código, a lo único que Larry le preocupa es que la llave de cierre de un BLOQUE multilínea debe alinearse con la palabra reservada que inició esa estructura.

source: Beyond that, he has other preferences that aren't so strong:
es_es: Aparte de eso, él tiene otras preferencias que no son tan estrictas:

source: 4-column indent.
es_es: Sangrado a 4 columnas.

source: Opening curly on same line as keyword, if possible, otherwise line up.
es_es: Llave de apertura en la misma línea que la palabra reservada, si es posible, o si no, alineada en vertical con ella.

source: Space before the opening curly of a multi-line BLOCK.
es_es: Espacio antes de llave de apertura de un BLOQUE multilínea.

source: One-line BLOCK may be put on one line, including curlies.
es_es: Un BLOQUE de una sola línea puede ser puesto en una sola línea, incluyendo sus llaves.o

source: No space before the semicolon.
es_es: Sin espacio antes de punto y coma.

source: Semicolon omitted in "short" one-line BLOCK.
es_es: Punto y coma omitido en BLOQUE "pequeño" de una sola línea.

source: Space around most operators.
es_es: Espacio alrededor de la mayoría de operadores.

source: Space around a "complex" subscript (inside brackets).
es_es: Espacio alrededor de un subíndice "complejo" (entre corchetes).

source: Blank lines between chunks that do different things.
es_es: Líneas en blanco entre bloques que hacen cosas diferentes.

source: Uncuddled elses.
es_es: else en nueva línea. No en la misma línea que la llave de cierre del if.

source: No space between function name and its opening parenthesis.
es_es: Sin espacio entre el nombre de función y su paréntesis de apertura.

source: Space after each comma.
es_es: Espacio después de cada coma.

source: Long lines broken after an operator (except C<and> and C<or>).
es_es: Dividir líneas largas después de un operador (excepto C<and> y C<or>).

source: Space after last parenthesis matching on current line.
es_es: Espacio después del último paréntesis coincidente en la línea actual.

source: Line up corresponding items vertically.
es_es: Alinear elementos correspondientes verticalmente.

source: Omit redundant punctuation as long as clarity doesn't suffer.
es_es: Omitir la puntuación redundante mientras no se reduzca la claridad.

source: Larry has his reasons for each of these things, but he doesn't claim that everyone else's mind works the same as his does.
es_es: Larry tiene sus razones para cada una de estas ideas, pero el no aspira que la mente de los demás trabaje de la misma forma que la suya.

source: Here are some other more substantive style issues to think about:
es_es: Aquí hay otras cuestiones de estilo que sí que hay que recordar:

source: Just because you I<CAN> do something a particular way doesn't mean that you I<SHOULD> do it that way.
es_es: Sólo porque usted I<PUEDA> hacer algo de una determinada manera no significa que usted I<DEBA> hacerlo de esa manera.

source: Perl is designed to give you several ways to do anything, so consider picking the most readable one.
es_es: Perl está diseñado para darle varias opciones para hacer cualquier cosa, así que elija la más legible.

source: For instance
es_es: Por ejemplo

source: open(FOO,$foo) || die "Can't open $foo: $!";
es_es: open(FOO,$foo) || die "No puedo abrir $foo: $!";

source: is better than
es_es: es mejor que

source: die "Can't open $foo: $!" unless open(FOO,$foo);
es_es: die "No puedo abrir $foo: $!" unless open(FOO,$foo);

source: because the second way hides the main point of the statement in a modifier.
es_es: porque la segunda forma esconde el objetivo principal de la instrucción dentro de un modificador.

source: On the other hand
es_es: De otra forma

# print "Starting analysis " if $verbose;
source: print "Starting analysis\n" if $verbose;
es_es: print "Empezando análisis\n" if $locuaz;

# $verbose && print "Starting analysis ";
source: $verbose && print "Starting analysis\n";
es_es: $locuaz && print "Empezando análisis\n";

source: because the main point isn't whether the user typed B<-v> or not.
es_es: porque el objetivo principal no es si el usuario escribió B<-v> o no.

source: Similarly, just because an operator lets you assume default arguments doesn't mean that you have to make use of the defaults.
es_es: De forma similar, sólo porque un operador le permite asumir argumentos por defecto no significa que usted tenga que hacer uso de esos valores por defecto.

source: The defaults are there for lazy systems programmers writing one-shot programs.
es_es: Los valores por defecto son para los programadores de sistemas perezosos escribiendo programas pequeños.

source: If you want your program to be readable, consider supplying the argument.
es_es: Si usted quiere que su programa sea legible, considere suplir el argumento.

source: Along the same lines, just because you I<CAN> omit parentheses in many places doesn't mean that you ought to:
es_es: De la misma forma, sólo porque usted I<PUEDA> omitir paréntesis en muchos lugares no significa que deba hacerlo:

source: When in doubt, parenthesize.
es_es: En caso de duda, coloque paréntesis.

source: At the very least it will let some poor schmuck bounce on the % key in B<vi>.
es_es: Por lo menos esto hará que algún pobre inútil pueda usar la tecla % en B<vi>.

source: Even if you aren't in doubt, consider the mental welfare of the person who has to maintain the code after you, and who will probably put parentheses in the wrong place.
es_es: Incluso si usted no tiene dudas, considerar el bienestar mental de la persona que tenga que mantener el código después de usted, y quien seguramente pondrá los paréntesis en el lugar equivocado.

source: Don't go through silly contortions to exit a loop at the top or the bottom, when Perl provides the C<last> operator so you can exit in the middle.
es_es: No haga tontas contorsiones para salir de un bucle al inicio o al final, cuando Perl dispone del operador C<last> para que pueda salir desde el interior.

source: Just "outdent" it a little to make it more visible:
es_es: Sólo "desángrelo" un poco para hacerlo más visible:

source: LINE: for (;;) { statements; last LINE if $foo; next LINE if /^#/; statements; }
es_es: LINEA: for (;;) { instrucciones; last LINEA if $foo; next LINEA if /^#/; instrucciones; }

source: Don't be afraid to use loop labels--they're there to enhance readability as well as to allow multilevel loop breaks.
es_es: No se asuste de usar etiquetas de bucles -están para aumentar la legibilidad así como permitir rupturas de bucles multiniveles-.

source: See the previous example.
es_es: Ver el ejemplo anterior.

source: Avoid using C<grep()> (or C<map()>) or `backticks` in a void context, that is, when you just throw away their return values.
es_es: Evite usar C<grep()> (o C<map()>) o `acentos graves` en contexto nulos, es decir, cuando usted no va usar los valores de retorno.

source: Those functions all have return values, so use them.
es_es: Todas estas funciones tienen valores de retorno, así que úselos.

source: Otherwise use a C<foreach()> loop or the C<system()> function instead.
es_es: De otra forma, use un bucle C<foreach()> o la función C<system()>.

source: For portability, when using features that may not be implemented on every machine, test the construct in an eval to see if it fails.
es_es: Para la portabilidad, cuando utilice características que pueden no estar implementadas en todas las máquinas, compruebe el código en un eval para ver si falla.

source: If you know what version or patchlevel a particular feature was implemented, you can test C<$]> (C<$PERL_VERSION> in C<English>) to see if it will be there.
es_es: Si usted sabe en qué versión o patchlevel fue implementada una cierta característica, puede comprobar C<$]> (C<$PERL_VERSION> en C<English>) para ver si está incluida.

source: The C<Config> module will also let you interrogate values determined by the B<Configure> program when Perl was installed.
es_es: El módulo C<Config> le permitirá también interrogar por los valores determinados por el programa B<Configure> cuando Perl fue instalado.

source: Choose mnemonic identifiers.
es_es: Elija identificadores mnemónicos.

source: If you can't remember what mnemonic means, you've got a problem.
es_es: Si no puede recordar lo que significa un mnemónico, usted tiene un problema.

source: While short identifiers like C<$gotit> are probably ok, use underscores to separate words in longer identifiers.
es_es: Mientras identificadores cortos como C<$leenombre> están bien, use guiones bajos para separar palabras en los identificadores más largos.

source: It is generally easier to read C<$var_names_like_this> than C<$VarNamesLikeThis>, especially for non-native speakers of English.
es_es: Generalmente es más fácil leer C<$var_nombres_como_este> que C<$VarNombresComoEste>, especialmente para los que no sean castellanoparlantes.

source: It's also a simple rule that works consistently with C<VAR_NAMES_LIKE_THIS>.
es_es: Es una regla que funciona también con C<VAR_NOMBRES_COMO_ESTE>.

source: Package names are sometimes an exception to this rule.
es_es: Los nombres de los paquetes son, en alguna ocasión, una excepción a esta regla.

source: Perl informally reserves lowercase module names for "pragma" modules like C<integer> and C<strict>.
es_es: Perl, de forma informal, reserva nombres de módulos en minúscula para módulos "pragma" como C<integer> y C<strict>.

source: Other modules should begin with a capital letter and use mixed case, but probably without underscores due to limitations in primitive file systems' representations of module names as files that must fit into a few sparse bytes.
es_es: Otros módulos deben comenzar con una letra mayúscula y usar luego una mezcla de mayúsculas y minúsculas, pero probablemente sin guiones bajos debido a limitaciones en la representación de nombres de módulos como ficheros en sistemas de ficheros primitivos que deben ajustarse a unos pocos bytes.

source: You may find it helpful to use letter case to indicate the scope or nature of a variable.
es_es: Puede encontrar útil usar el tamaño de caja de las letras para indicar el ámbito o naturaleza de una variable.

source: $ALL_CAPS_HERE constants only (beware clashes with perl vars!)
es_es: $TODO_MAYUSCULAS Sólo constantes (¡cuidado con variables perl!)

source: $Some_Caps_Here package-wide global/static
es_es: $Algunas_Mayusculas Ámbito de paquete/estática

source: $no_caps_here function scope my() or local() variables
es_es: $sin_mayusculas Ámbito de función, variables my() o local()

source: Function and method names seem to work best as all lowercase.
es_es: Funciones y nombres de métodos parece que funcionan mejor con minúsculas.

source: E.g., C<$obj-E<gt>as_string()>.
es_es: Ej., C<$obj-E<gt>como_cadena()>.

source: You can use a leading underscore to indicate that a variable or function should not be used outside the package that defined it.
es_es: Puede usar un guión bajo inicial para indicar que una variable o función no debe ser usado fuera del paquete que lo define.

source: If you have a really hairy regular expression, use the C</x> modifier and put in some whitespace to make it look a little less like line noise.
es_es: Si tiene una expresión regular especialmente complicada, use el modificador C</x> y ponga algunos espacios en blanco para que no parezca una línea telefónica con ruido de fondo.

source: Don't use slash as a delimiter when your regexp has slashes or backslashes.
es_es: No use barras inclinadas como delimitador cuando en su expresión regular tenga barras o contrabarras inclinadas.

source: Use the new C<and> and C<or> operators to avoid having to parenthesize list operators so much, and to reduce the incidence of punctuation operators like C<&&> and C<||>.
es_es: Use los nuevos operadores C<and> y C<or> para evitar poner demasiados paréntesis en listas de operadores y para reducir la incidencia de puntuación de operadores como C<&&> y C<||>.

source: Call your subroutines as if they were functions or list operators to avoid excessive ampersands and parentheses.
es_es: Llame a sus subrutinas como si fueran funciones u operadores de lista para evitar el excesivo número de ligaduras (&&) y paréntesis.

source: Use here documents instead of repeated C<print()> statements.
es_es: Use documentos incluídos en vez de repetir instrucciones C<print()>.

source: Line up corresponding things vertically, especially if it'd be too long to fit on one line anyway.
es_es: Alineé elementos correspondientes verticalmente, especialmente si es demasiado largo el espacio que ocupan como para entrar en una sola línea.

source: mkdir $tmpdir, 0700 or die "can't mkdir $tmpdir: $!";
es_es: mkdir $tmpdir, 0700 or die "no puedo hacer mkdir $tmpdir: $!";

source: chdir($tmpdir) or die "can't chdir $tmpdir: $!";
es_es: chdir($tmpdir) or die "no puedo hacer chdir $tmpdir: $!";

source: mkdir 'tmp', 0777 or die "can't mkdir $tmpdir/tmp: $!";
es_es: mkdir 'tmp', 0777 or die "no puedo hacer mkdir $tmpdir/tmp: $!";

source: Always check the return codes of system calls.
es_es: Siempre compruebe los valores devueltos por las llamadas al sistema.

source: Good error messages should go to C<STDERR>, include which program caused the problem, what the failed system call and arguments were, and (VERY IMPORTANT) should contain the standard system error message for what went wrong.
es_es: Los buenos mensajes de error deben ir al C<STDERR>, incluyendo qué programa causó el problema, qué función del sistema y qué argumentos fueron, y (MUY IMPORTANTE) debe contener el mensaje de error estándar del sistema por el cual falló.

source: Here's a simple but sufficient example:
es_es: Aquí hay un simple pero útil ejemplo:

source: opendir(D, $dir) or die "can't opendir $dir: $!";
es_es: opendir(D, $dir) or die "no puedo hacer opendir $dir: $!";

source: Line up your transliterations when it makes sense:
es_es: Alinear transliteraciones cuando tengan sentido:

source: Think about reusability.
es_es: Piense en la reutilización.

source: Why waste brainpower on a one-shot when you might want to do something like it again?
es_es: ¿Por qué perder la energía cerebral de un acierto cuando puede volver a usarlo otra vez?

source: Consider generalizing your code.
es_es: Considere generalizar su código.

source: Consider writing a module or object class.
es_es: Considere escribir un módulo o una clase de objetos.

source: Consider making your code run cleanly with C<use strict> and C<use warnings> (or B<-w>) in effect.
es_es: Considere hacer su código limpio utilizando C<use strict> y C<use warnings> (o B<-w>).

source: Consider giving away your code.
es_es: Considere compartir su código.

source: Consider changing your whole world view.
es_es: Considere cambiar su punto de vista vital.

source: Consider... oh, never mind.
es_es: Considere... ¡oh!, olvídelo.

source: Try to document your code and use Pod formatting in a consistent way.
es_es: Intente documentar su código y usar formateo Pod de una forma consistente.

source: Here are commonly expected conventions:
es_es: Están son las convenciones más usadas:

source: use C<CE<lt>E<gt>> for function, variable and module names (and more generally anything that can be considered part of code, like filehandles or specific values).
es_es: use C<CE<lt>E<gt>> por función, variable y nombres de módulos (y más generalmente cualquier cosa que pueda ser considerada parte del código, como manejadores de archivo o valores específicos).

source: Note that function names are considered more readable with parentheses after their name, that is C<function()>.
es_es: Note como los nombres de función se vuelven más legibles con los paréntesis detrás de su nombre, como esta C<funcion()>.

source: use C<BE<lt>E<gt>> for commands names like B<cat> or B<grep>.
es_es: use C<BE<lt>E<gt>> para nombres de comandos como B<cat> o B<grep>.

source: use C<FE<lt>E<gt>> or C<CE<lt>E<gt>> for file names.
es_es: use C<FE<lt>E<gt>> o C<CE<lt>E<gt>> para nombres de ficheros.

source: C<FE<lt>E<gt>> should be the only Pod code for file names, but as most Pod formatters render it as italic, Unix and Windows paths with their slashes and backslashes may be less readable, and better rendered with C<CE<lt>E<gt>>.
es_es: C<FE<lt>E<gt>> debe ser el único código Pod para nombres de fichero, pero como la mayoría de los formateadores de Pod lo muestran en cursiva, los caminos Unix y Windows con sus barras y contrabarras pueden hacerlo menos legible, por lo que es mejor mostrarlo con C<CE<lt>E<gt>>.

source: Be consistent.
es_es: Sea coherente.

source: Be nice.
es_es: Sea amable.

source: =head1 SYNOPSIS
es_es: =head1 SINOPSIS

source: =head1 AUTHOR
es_es: =head1 AUTOR

source: =head1 SEE ALSO
es_es: =head1 VEA TAMBIÉN

source: If you read this file _as_is_, just ignore the funny characters you see.
es_es: Si lees este fichero _tal_como_es_, ignora los caracteres curiosos que veas.

source: It is written in the POD format (see pod/perlpod.pod) which is specifically designed to be readable as is.
es_es: Está escrito en formato POD (ver pod/perlpod.pod) que está específicamente diseñado para ser legible de forma sencilla.

source: README.openbsd - Perl version 5 on OpenBSD systems
es_es: README.openbsd - Perl versión 5 sobre sistemas OpenBSD

source: This document describes various features of OpenBSD that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es_es: Este documentos describe varias características de OpenBSD que afectarán a cómo Perl versión 5 (de ahora en adelante sólo Perl) es compilado y/o ejecutado.

source: =head2 OpenBSD core dumps from getprotobyname_r and getservbyname_r with ithreads
es_es: =head2 OpenBSD vuelca el núcleo desde getprotobyname_r y getservbyname_r con ithreads

source: When Perl is configured to use ithreads, it will use re-entrant library calls in preference to non-re-entrant versions.
es_es: Cuando Perl está configurado para usar ithreads, usará llamadas de biblioteca reentrantes preferentemente sobre versiones no-reentrantes.

source: There is an incompatability in OpenBSD's C<getprotobyname_r> and C<getservbyname_r> function in versions 3.7 and later that will cause a SEGV when called without doing a C<bzero> on their return structs prior to calling these functions.
es_es: Existe una incompatibilidad en las funciones de OpenBSD C<getprotobyname_r> y C<getservbyname_r> en las versiones 3.7 y superiores que causarán un SEGV cuando se llamen sin haber hecho antes un C<bzero> en sus estructuras de retorno antes de llamar a estas funciones.

source: Current Perl's should handle this problem correctly.
es_es: El Perl actual debería manejar este problema correctamente.

source: Older threaded Perls (5.8.6 or earlier) will run into this problem.
es_es: Anteriores Perls con threads (5.8.6 o anteriores) tendrán este problema.

source: If you want to run a threaded Perl on OpenBSD 3.7 or higher, you will need to upgrade to at least Perl 5.8.7.
es_es: Si quiere correr un Perl con hilos sobre OpenBSD 3.7 o superior, necesitará actualizar Perl al menos a la versión 5.8.7.

source: Please report any errors, updates, or suggestions to F<perlbug@perl.org>.
es_es: Por favor, informe de cualquier error, actualización o sugerencias a F<perlbug@perl.org>.

source: It is written in the POD format (see pod/perlpod.pod) which is specially designed to be readable as is.
es_es: Está escrito en formato POD (ver pod/perlpod.pod) que está específicamente diseñado para ser legible de forma sencilla.

source: README.apollo - Perl version 5 on Apollo DomainOS
es_es: README.apollo - Perl versión 5 sobre Apollo DomainOS

source: The following tests are known to fail as of Perl 5.005_03:
es_es: Los siguientes test se sabe que fallan en 5.005_03:
